Public Member Functions | List of all members
API_IAttributeFolderEventHandler Class Reference
Notifications Manager
Defining an interface for Attribute Folder event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IAttributeFolderEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const override final
 Public Member Functions inherited from API_IEventHandler
virtual  | ~API_IEventHandler ()=default
virtual GS::UniString  | GetName () const =0
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const =0
 Public Member Functions inherited from API_IObjectEventHandler
virtual  | ~API_IObjectEventHandler ()=default
virtual void  | OnCreated (const GS::HashSet< API_Guid > &) const
virtual void  | OnModified (const GS::HashSet< API_Guid > &) const
virtual void  | OnDeleted (const GS::HashSet< API_Guid > &) const
Detailed Description
Defining an interface for Attribute Folder event handlers.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IAttributeFolderEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotfier | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString API_IAttributeFolderEventHandler::GetName  |  ( |   | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.